## Setup

*This is already done for you.* First, we install the python requirements from **requirements.txt**. There's lot of libraries, but most importantly, this installs the  **ipython-sql** library that enables SQL execution in Jupyter Notebooks and an older version of SQLAlchemy (1.4.46) that works with Codespaces.

❗ The command ```**%load_ext sql**``` is used to activate sql in Jupyter.

❗ The command ```**%sql sqlite:///<database_name>.db**``` is used to select the working database. (Note 3 slashes!)

In [10]:
# Start the Jupyter SQL engine, connecting to a SQLite database 
%reload_ext sql 
%sql postgresql://postgres:postgres@db/postgres

## Queries

The command **%%SQL** is referenced before writing an SQL query

Comments must be written in SQL syntax using double dash lines: **--**

#### Query. 1
Write a query that returns everything from the member table

In [11]:
%%sql
-- This is a command that queries everything from the 'member' table

SELECT * FROM member

 * postgresql://postgres:***@db/postgres
5 rows affected.

[(1, 'Betty', 'M', 'Hibler', '1234567890', 987, '314 Prospect St, Berea, KY, 40403', 5),
 (2, 'Landra', '', 'Lewis', '2345678901', 654, '619 Chestnut St, Berea, KY, 40403', 3),
 (3, 'Travis', '', 'Bolinger', '3456789012', 321, '314 University Dr Apt A, Richmond, KY, 2841', 2),
 (4, 'Rachel', '', 'White', '4567890123', 432, '1101 Elm St, Danville, KY, 40422', 7),
 (5, 'Joanie', '', 'Lukins', '5678901234', 876, '503 Ohara Dr, Daville, KY, 40422', 4)]

#### Query 2 
Write a query that returns everything from the chapter table

In [12]:
%%sql

SELECT * FROM chapter

 * postgresql://postgres:***@db/postgres
2 rows affected.

[('Madison County', 50, 'Landra Lewis', 'alex@example.com'),
 ('Wilderness Trace', 30, 'Emily Brown', 'emily@example.com')]

In [13]:
%%sql

SELECT * FROM event

 * postgresql://postgres:***@db/postgres
5 rows affected.

[('Community Building', 'Convention Center', 'Environmental Preservation', datetime.date(2024, 4, 1), 200),
 ('Workshop', 'Community Center', 'Environmental Preservation', datetime.date(2024, 4, 15), 80),
 ('Hackathon', 'Convention Center', 'Environmental Preservation', datetime.date(2024, 4, 1), 200),
 ('Seedy Workshop', 'Community Center', 'Environmental Preservation', datetime.date(2024, 4, 15), 80),
 ('How to sleep in class', 'Community Center', 'Sleep', datetime.date(2024, 4, 15), 80)]

In [14]:
%%sql

SELECT * FROM donation

 * postgresql://postgres:***@db/postgres
5 rows affected.

[(1, None, 'Laptop', 800),
 (2, None, 'Books', 100),
 (3, None, 'Laptop', 800),
 (4, None, 'Books', 100),
 (5, None, 'Laptop', 800)]

In [18]:
%%sql

SELECT m.firstName, m.lastName, m.memberId, d.item
FROM member m
JOIN donation d ON m.memberId = d.donorId;

 * postgresql://postgres:***@db/postgres
0 rows affected.

[]